<template>
  <section class="manual">
    <h2 class="manual-title">Вопросы и ответы</h2>
    <ManualBlock v-for="item in list" :key="item.id" :item="item" />
    <div class="manual-content">
      <h2 class="manual-title">Ссылки и инструкции</h2>
      <div v-for="link in links" :key="link.id" class="manual-list">
        <router-link class="manual-item" :to="link.link"
          >{{ link.text }}
          <div class="manual-icon"></div>
        </router-link>
      </div>
    </div>
  </section>
</template>

<script setup>
import { onMounted, ref } from "vue";
import ManualBlock from "../components/global/manual/ManualBlock.vue";

const emits = defineEmits(["handleChangeTitle"]);
onMounted(() => {
  (() => emits("handleChangeTitle", "Руководство пользователя"))();
});

const list = ref([
  {
    id: 0,
    title: "Как я могу получить нотариально заверенный электронный документ?",
    text: `Текст образец. Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему.Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.`,
  },
  {
    id: 1,
    title:
      "Каковы сроки исполнения нотариальных действий в электронной нотариальной конторе?",
    text: `Текст образец. Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему.Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.`,
  },
  {
    id: 2,
    title:
      "Какие документы я могу оформить в электронной нотариальной конторе, если я не являюсь гражданином данной страны?",
    text: `Текст образец. Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему.Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.`,
  },
  {
    id: 3,
    title:
      "Как я могу проверить подлинность нотариально заверенного электронного документа?",
    text: `Текст образец. Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему.Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.`,
  },
]);

const links = ref([
  {
    id: 0,
    text: "Видеоинструкция по оформлению заявки",
    link: "/",
  },
  {
    id: 1,
    text: "Инструкция по регистрации документов",
    link: "/",
  },
  {
    id: 2,
    text: "Видеоинструкция по оформлению заявки",
    link: "/",
  },
  {
    id: 3,
    text: "Инструкция при регистрации заявок с участием иностранного гражданина",
    link: "/",
  },
  {
    id: 4,
    text: "Порядок работы с электронными документами",
    link: "/",
  },
]);
</script>

<style lang="scss">
.manual {
  padding: 40px;
  background: #ffffff;
  box-shadow: 0px 10px 40px #e9e9e9;
  margin-top: 70px;
  &-head {
    svg {
      min-width: 24px;
    }
  }
  &-title {
    font-weight: 600;
    font-size: 20px;
    color: #24334b;
    margin-bottom: 15px;
  }

  &-list {
    display: flex;
    flex-direction: column;
  }

  &-icon {
    width: 24px;
    height: 24px;
    background: url("../components/global/manual/Icons/arrow.svg") center;
    transition: 0.3s;
  }

  &-item {
    padding: 15px 0 17px;

    display: flex;
    align-items: center;
    justify-content: space-between;
    gap: 15px;
    transition: 0.3s;

    font-weight: 400;
    font-size: 16px;
    color: #24334b;
    transition: 0.3s;

    &:hover {
      text-decoration-line: underline;
      color: #1baa75;

      .manual-icon {
        background: url("../components/global/manual/Icons/activeArrow.svg")
          center;
      }
    }
  }
}

@media screen and (max-width: 820px) {
  .manual {
    padding: 0;
    background: unset;
    box-shadow: none;
    margin-top: 30px;
    &-content {
      margin-top: 50px;
    }
    &-head {
      font-size: 16px;
    }
    &-title {
      font-size: 20px;
    }
  }
}
</style>
