<template>
  <section
    id="faq"
    class="question"
  >
    <div class="container">
      <div class="question__content">
        <div class="question__img">
          <img
            src="/src/assets/images/Question/question.png"
            alt=""
          >
        </div>
        <div class="question__info">
          <h2>Вопросы и ответы</h2>
          <QuestionItem
            v-for="item in items"
            :key="item.title"
            :title="item.title"
            :description="item.description"
          />
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
import QuestionItem from './QuestionItem.vue'

const items = [
  {
    id: 0,
    title: 'Что такое доверенность?',
    description:
      'Доверенность — письменное уполномочие, выдаваемое одним лицом другому лицу для представительства перед третьими лицами в правоотношениях. Сторонами доверенности выступают доверитель («представляемый») и доверенное лицо («представитель», «поверенный»). ',
  },
  {
    id: 1,
    title: 'Что нужно для обеспечения доказательства?',
    description:
      'По просьбе заинтересованных лиц нотариусы производят обеспечение доказательств, необходимых в случае возникновения дела в судебных или административных органах, если имеются основания полагать, что представление доказательств впоследствии станет невозможным или затруднительным.  Нотариусы не производят обеспечение доказательств по делам, которые в момент обращения заинтересованных лиц к нотариусу находятся в производстве суда или административного органа. Если необходимые доказательства требуются для ведения дел в органах иностранных государств, обеспечение доказательств производится государственными нотариусами, независимо от того, что дело в момент обращения заинтересованного лица уже находится в производстве органов иностранных государств.  Заинтересованное в обеспечении доказательств лицо (будущий истец, предполагаемый ответчик) подает нотариусу заявление, подпись которого или его представителя может быть засвидетельствована нотариусом.  В порядке обеспечения доказательств нотариусы допрашивают свидетелей, производят осмотр письменных и вещественных доказательств, назначают экспертизу.  При выполнении процессуальных действий по обеспечению доказательств нотариусы руководствуются соответствующими правилами Гражданского процессуального кодекса Кыргызской Республики. ',
  },
  {
    id: 2,
    title: 'На какой срок и когда выдается Свидетельство о праве на наследство?',
    description:
      'Свидетельство о праве на наследство выдается наследникам в любое время по истечении шести месяцев со дня открытия наследства, при наличии неопровержимых доказательств, подтверждающих принадлежность имущества умершему. Указанные правила, как вы видите не сложны и не изменялись уже очень долго. Однако жизнь сформировала несколько устойчивых стереотипов в обществе, которые иногда подбрасывают людям весьма неприятные сюрпризы и до сих пор вызывают споры.',
  },
  {
    id: 3,
    title: 'На какой срок можно сделать Доверенность на управление и распоряжение имуществом?',
    description:
      'Доверенность выдается на срок не более трех лет. Если срок в доверенности не указан, она сохраняет силу в течение одного года со дня ее выдачи. ',
  },
]
</script>

<style lang="scss">
@import "@/assets/scss/variables.scss";

.question {
   @media screen and (max-width: 991px) {
      max-width: 520px;
      margin: 0 auto;
    }
  &__content {
    display: flex;
    justify-content: space-between;
    margin-bottom: 120px;
    @media screen and (max-width: 991px) {
      margin-bottom: 50px;
      justify-content: center;
    }
  }

  &__info {
    @media screen and (min-width: 992px) {
      width: 60%;
    }

    h2 {
      font-weight: 600;
      font-size: 36px;
      color: $text-dark-blue;
      @media screen and (max-width: 991px) {
        font-size: 24px;
        line-height: 29px;
      }
    }
  }

  &__img {
    @media screen and (max-width: 991px) {
     display: none;
    }
  }
}
</style>
